{"config": [{"config": {"activity_regularizer": null, "mask_zero": false, "embeddings_constraint": null, "trainable": true, "input_length": 40, "embeddings_regularizer": null, "batch_input_shape": [null, 40], "embeddings_initializer": {"config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "class_name": "RandomUniform"}, "input_dim": 58, "dtype": "int32", "name": "embedding_1", "output_dim": 24}, "class_name": "Embedding"}, {"config": {"go_backwards": false, "activity_regularizer": null, "bias_constraint": null, "recurrent_dropout": 0.2, "unit_forget_bias": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, 24], "kernel_constraint": null, "kernel_regularizer": null, "return_sequences": true, "name": "lstm_1", "bias_regularizer": null, "implementation": 2, "units": 512, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dtype": "float32", "dropout": 0.2, "trainable": true, "recurrent_constraint": null, "recurrent_regularizer": null, "stateful": false, "unroll": false}, "class_name": "LSTM"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"go_backwards": false, "activity_regularizer": null, "bias_constraint": null, "recurrent_dropout": 0.2, "unit_forget_bias": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "kernel_regularizer": null, "return_sequences": true, "name": "lstm_2", "bias_regularizer": null, "implementation": 2, "units": 512, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dropout": 0.2, "trainable": true, "recurrent_constraint": null, "recurrent_regularizer": null, "stateful": false, "unroll": false}, "class_name": "LSTM"}, {"config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"name": "time_distributed_1", "layer": {"config": {"bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "units": 58, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "activation": "linear", "name": "dense_1"}, "class_name": "Dense"}, "trainable": true}, "class_name": "TimeDistributed"}, {"config": {"activation": "softmax", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow"}